Repository: atlas-studios/ForcedExposureDailyAfterRebirth
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 要是前者就罢了，但若是后者....
en_us: It would be fine if it was the former, but if it was the latter...

source: 要是这两兄妹再狠一点，说不定这帝都没他们一家三口的容身之处 。
en_us: If Ye Feng and Ye Li chose to be more ruthless, Meng Fei's family might no longer be able to live in the capital.

source: 要知道平时想见这位大佬一面，可是千金难求的。
en_us: It was usually extremely difficult to see him.

source: 要说于向阳，也是帝都大学风云人物之一。
en_us: Yu Xiangyang was one of the influential figures in Beijing University.

source: 要说叶家这关系，也是比较复杂。
en_us: Actually the relationships between the members of the Ye Family were rather complicated.

source: 要说叶家，如今也是帝都第一世家，同徐家在这座昌荣繁华的城市并列第一的两大超级世家。
en_us: The Ye Family was now the top family in Beijing, alongside the Xu Family, the two being the most powerful families in this prosperous and bustling city.

source: 要说现在的叶漓，性格还是十分叛逆。
en_us: Her current character was still very rebellious.

source: 要说程艳在这个学校也有点关系，虽然很多学生家世都不错，但是大多都挺怕她。
en_us: Cheng Yan had some connections in the school. Although most of the students were from wealthy families they were rather afraid of her.

source: 见人散了开，艺术系的导师程艳才注意到了两姐妹。
en_us: The arts tutor Cheng Yan, finally noticed the pair of sisters after everyone left.

source: 见偶像脸色阴沉，几个女生也有些怕了，她们就是怎么想，也没想到叶漓和枫神竟然是兄妹关系，刚还想对叶漓动手，这会儿是悔的肠子都青了，赶忙解释道。
en_us: Seeing the gloomy expression on their idol's face, the girls were a little scared as that was what they thought. They didn't expect Ye Li and Ye Feng to be siblings. They wanted to attack Ye Li just now but now, they were filled with regret.

source: 见大家脸色都不大好看，二夫人似是才反应过来自己说错话了一般，赶忙歉意的道：“害，瞧我这嘴，我也只是听说而已，不知道是真还是假，刚刚也听楼下那几个客人说了一些关于阿漓和那个什么大明星纠缠不清的事情，听说还闹出了绯闻，我只是觉得，这件事还是要处理一下，以免到时候误会可就说不清了。”
en_us: Seeing that everyone seemed a little displeased, Kong Yun acted like she had realized that she had said the wrong thing. She hurriedly said apologetically, "Ah, I was just making a casual remark. I don't know if it's true or not. I've just heard the people downstairs talking about Ye Li being embroiled in a scandal with a huge celebrity. I just thought that we should settle this matter, lest we can't clear the misunderstanding when the time comes."

source: 见她一副死猪不怕开水烫的表情，那女生恼怒至极，“那你就给我等着吧！”
en_us: Seeing how stubborn and smug she was, the girl flew into a rage and barked, "Just you wait and see!"

source: 见她的脸色突然变得难看，徐凤年的表情终于认真了起来，“你是认真的？确定不会后悔？”
en_us: Seeing that she suddenly looked disoriented, Xu Fengnian finally put on a solemn expression and asked, "Are you serious? Are you sure you won't regret it?"

source: 见她竟然要闹到警察局，女同学的脸都白了。
en_us: Seeing that she was actually going to the police station, the female student's face turned pale.

source: 见她这么容易就答应了，叶眉眼中顿时一脸欣喜，表情也是热络了几分，连连讨好的道，“谢谢姐姐，你是天下最好的姐姐了。”
en_us: Seeing that she had Ye Mei's eyes were suddenly filled with joy, and her expression became much friendlier. She continuously tried to please Ye Mei, "Thank you, Ye Li, you're the best sister in the world."

source: 见她这幅死猪不怕开水烫的样子，孟父一家人恼怒不已，看向校长道：“校长你看看，她这什么态度！你今天不给我们一个交代，我们是绝不会罢休的！”
en_us: Seeing how nonchalant and dauntless she was, Meng Fei's father flew into a rage and looked at the principal. "Principal, look at her attitude! We won't let this go unless she gives us an explanation today!"

source: 见她这态度，两个女生更是生气，其中一人伸手揪住了她的衣服，“我警告你，离徐晗远一点”
en_us: Infuriated by her attitude, one of the two girls grabbed her by her shirt and yelled, "I'm warning you, stay far, far away from Xu Han."

source: 见老爷子问，徐媛和二夫人眼神同时一闪，二夫人开口说：“我也是听聚会上的一些人说的，好像是阿漓和娱乐圈的一个明星闹出了绯闻关系，这件事在网上闹的很大呢。”
en_us: Seeing that the old patriarch had asked about it. Xu Yuan and Kong Yun's eyes lit up at the same time. Kong Yun said, "I heard it from the people at the gathering too. It seems that Ye Li and a famous celebrity of the entertainment industry have gotten involved in a scandal and this matter has gone viral on the internet."

source: 解释什么的真的是为难人。
en_us: Explaining was really a difficult thing to do.

source: 让周围的人脊背一瞬发凉。
en_us: It sent a cold chill down everyone else's spines.

source: 让她也尝尝自己喜欢的人，和别的女人亲亲我我是什么滋味。
en_us: She wanted Ye Mei to have a taste of how it feels to see the person she liked behaving affectionately with another woman.

source: 记得不错的话，叶眉是系花吧。
en_us: 'If I remember correctly, Ye Mei is the school belle.'

source: 评论区下面，也全都是各种各样小姐姐好纯之类夸赞的话。
en_us: The comments section were all filled with all sorts of praises and compliments for her pure and innocent demeanor.

source: 话是对她说，可眼睛却直勾勾的看着自己身旁的男人呢。
en_us: Ye Mei was talking to her but her eyes were fixed on the man beside her.

source: 该死的，我一定不会放过你的。
en_us: 'Damn it, I won't let you off."

source: 语气十分不善。
en_us: They sounded extremely unfriendly.

source: 语气很冷。
en_us: His tone was aloof.

source: 说不定严重还会被学校退学，毕竟进过警察局的人都是有案底的，不管是学校，还是未来工作，都会有影响！
en_us: She might even get expelled by the school. After all, those who were detained in the police station would leave a record that would affect one both in school, and in the workforce!

source: 说不定还会被大家当做了那种居心不良的人来处理，到时候有她好受。
en_us: Ye Mei thought that Ye Li might even be treated as a suspicious person with malicious intentions, and that she would definitely have a hard time then.

source: 说也可笑。
en_us: It was rather amusing, actually.

source: 说实话，学校开了这么多年，打架闹事的人他不是没看见，但是叶漓这看起来乖乖巧巧又可爱的女孩子，怎么会拿钢笔插进了人家的手心呢？
en_us: To be honest, the school had been established for many years and fighting was not uncommon. However, Ye Li looked like an obedient and adorable girl. How could she have stabbed someone else's palm with her pen?

source: 说是请，可他身后走过来的保镖告诉大家，但凡这几个人再多说一句，势必会被这些保镖毫不犹豫的丢出去。
en_us: Although he sounded polite, the presence of the bodyguards behind him was telling them that they would definitely be thrown out without hesitation if they dared to say something more.

source: 说着拉着她坐下。
en_us: As he spoke, he pulled her down onto the couch.

source: 说着，他不悦的目光已经落到了叶洛三兄弟脸上：“你们不是说阿漓没事嘛？这怎么解释！”
en_us: As he spoke, he stared at Ye Luo and his brothers in displeasure. "Didn't you guys say that Ye Li is alright? How do you explain this!?!"

source: 说罢，他做出一副温柔姿态，看向叶漓道：“阿漓，我会一直等到你原谅我为止的。”
en_us: After saying that, he pretended to be gentle and looked at Ye Li. "Li, I'll keep waiting until you forgive me."

source: 说罢，她看向叶枫：“三哥哥，我们走吧。”
en_us: She then looked at Ye Feng and said, "Ye Feng, let's go."

source: 说罢，她看向徐凤年，见对方表情风雨欲来，眼中闪过一抹得逞，嘴上却是天真的说：“我相信凤年哥哥也会理解你的，不然这样耽误下去，对你们谁都不好。”
en_us: She then looked at Xu Fengnian, only to see that he seemed extremely gloomy. A triumphant gaze flashed in her eyes but she nonetheless said innocently, "I believe that Brother Fengnian will understand you. Otherwise, if this drags on, it won't be good for any of you."

source: 说罢，她转身准备离开，走出两步，又说：“与其威胁我，老师您何不如担心下自己吧，毕竟，这x三可不是好当的.....”
en_us: After saying that, she turned around and got ready to leave. As soon as she took two steps, she said, "Instead of threatening me, why don't you worry about yourself, teacher? After all, it's not easy being a homewrecker..."

source: 说罢，就自己上了车，坐到了叶漓的身边。
en_us: He then got inside the car and sat beside Ye Li.

source: 说话的女人鄙夷的看向叶漓说。
en_us: The woman looked at Ye Li with disdain when she said that.

source: 说话的女生一噎，竟是被她怼的哑口无言。
en_us: The girl who was speaking choked, falling speechless because of her insult.

source: 说话的这人也是叶眉在学校的好姐妹，叫做周雪。
en_us: She was Zhou Xue, who was also one of Ye Mei's close friends.

source: 谁不知道，这帝都贵族大学背后最大的投资商就是叶家家主叶明。
en_us: Everyone knew that the biggest investor behind Beijing University was the patriarch of Ye Family, Ye Ming

source: 谁也不知道那神秘人是谁。
en_us: No one knew who the mysterious person was.

source: 谁也不识她叶漓！
en_us: No one knew Ye Li at all!

source: 谁也没将这事往叶漓的身上联想。
en_us: No one thought about Ye Li at all.

source: 谁也看不清楚她此时脸上的狠色。
en_us: None of them could see clearly the look of ruthlessness on her face.

source: 谁会接受自己的未婚妻，在外面和别的男人闹出这种绯闻？
en_us: Who could tolerate seeing their fiancée getting involved in a scandal with another man?

source: 谁可知，迎接她的，竟是地狱...
en_us: Who would have thought that what greeted her was hell...

source: 谁想到这叶眉话里藏针，丝毫就没有要悔改的意思。
en_us: However, Ye Mei posted a statement with a hidden meaning and she did not seem repentant at all.

source: 谁料丢了一晚上的脸。
en_us: To her surprise, she ended up being embarrassed for the entire night.

source: 谁料之后爸爸和哥哥飞机失事，之后叶家无主，一度陷入了危机当中，之后叶眉跑来告诉她，说徐凤年为了叶家的家产，暗地里在收购叶家的公司，想要夺取叶家财产。
en_us: To her surprise, after her father and brothers died in a plane crash, there was no one to take charge of the Ye Family and they slipped into a crisis. Later on, Ye Mei went to tell her that Xu Fengnian was secretly acquiring the Ye Family's company in a bid to encroach on the Ye Family's assets.

source: 谁料人家却拒绝了不说，转眼就和叶枫去吃饭，还上了热搜。
en_us: To his surprise, she turned him down and had lunch with Ye Feng instead, which caused her to end up on the list of most popular searches.

source: 谁料叶眉竟然还敢发上去。
en_us: To their surprise, Ye Mei had the audacity to post it.

source: 谁料因为今天早上满课，所以其他班没课的人早早就蹲在了教室门口。
en_us: Unexpectedly, many of the other students who did not have any lessons in the afternoon because all their lessons took place in the morning, had long camped outside her classroom.

source: 谁料徐凤年会开口。
en_us: She did not expect Xu Fengnian to say that.

source: 谁料想她自己就先找死了。
en_us: 'Who knew? Ye Li had courted death.

source: 谁料，这个男人从来没有将自己的热情放在眼里，每一次过来都是为了看叶漓，亦或者给她送礼物。
en_us: However, that man had never taken her enthusiasm seriously and whenever he turned up at their home, it was only because he wanted to see Ye Li or give her some gifts.

source: 谁知道她不仅没有瘦，还越来越胖了。
en_us: However, not only did she not lose any weight, she even got chubbier.

source: 谁知道这位好姐妹，表面盛世白莲，背地里竟然是那般蛇蝎黑心。
en_us: Who knew? Her wonderful sister looked kind and pure on the surface but beneath that facade, she was actually malicious and vicious.

source: 谁都听出来了，叶漓这是嘲讽二夫人说她和那些带节奏的脑残粉一样呢。
en_us: Everyone could tell that Ye Li was mocking Kong Yun and implying that she was the same as the brainless die-hard fans who were stirring things up.

source: 豪车划过繁华的街道，很快就停在了巍然屹立的帝都大学门口。
en_us: The luxurious car cut through the bustling street and soon came to a halt in front of the majestic Beijing University.

source: 走过来的这个少年确实很帅，就是叶漓这种家中坐拥几个极品帅哥哥哥的人看了也不由的惊艳。
en_us: The young man who walked over was indeed very handsome, and even Ye Li couldn't help but be impressed despite having three extremely handsome and dashing brothers at home.

source: 越想心里越不爽，徐凤年都有赶人的冲动。
en_us: The more he thought about it, the more upset Xu Fengnian felt. He even had an urge to chase Xu Han away.

source: 距离事情到现在，不过一个小时，她的粉丝已经破了百万，可见这件事影响多么庞大。
en_us: It had only been an hour since the incident and Ye Li had already gained more than a million followers, evidence of how impactful the incident was.

source: 跟我比？
en_us: 'Are you trying to compare to me?'

source: 跟着来的两个女生生怕叶眉不付钱似的，赶忙讨好的说。
en_us: The two girls hurriedly said serviently, trying to please her for fear that she wouldn't pay for them.

source: 跟那女生一同找茬的女生看着同伴的惨状，朝着叶漓怒目而视的威胁她，却怎么也不敢动手了。
en_us: The girl who was next to the other girl who was looking for a fight, immediately looked at Ye Li with a menacing and threatening gaze when she saw the terrible state that her friend was in.However, she dared not do anything.

source: 路过她身前时，还有意无意的停顿了一下。
en_us: When he passed by her, he even deliberately paused for a while.

source: 身上的连衣裙很巧妙的遮住了她原本有些肥胖的身材，衣服撑得刚刚好，不宽松，不紧身，明明很是一般的打扮，可偏偏好看极了！
en_us: Her dress amazingly hid her chubby body and she carried it rather well. It was neither too tight nor baggy and even though it was an ordinary outfit, she looked extremely gorgeous!

source: 身下的男人闷哼的一声。
en_us: The man beneath her let out a muffled grunt.

source: 身下舒适的感觉告诉她，这一切都是真的，她真的重生了。
en_us: The feeling of discomfort in her lower body told her that everything was real and that she had really been reborn.

source: 车子划过繁华的大街，很快就来到了帝都中心的贵族大学。
en_us: The car drove past the bustling avenue and they soon arrived in the university for upper-class students in the center of Beijing.

source: 转身离开的瞬间，他的脸已经彻底阴沉了下去。
en_us: At the instant that he turned around to leave, his face had already turned completely sullen.

source: 过了一个晚上，脑袋里面絮乱的记忆已经被她整理清楚。
en_us: After an entire night, she had already sorted out all the messy memories in her mind.

source: 还从来没有人敢这么挑衅她，这口气怎么吞的下去，今儿个不弄死叶漓，她就不信邪！
en_us: No one had ever dared to provoke her that way. How cold she take it lying down? She was bent on killing Ye Li today!

source: 还向阳我爱你呢，爱个锤子。
en_us: 'Xiangyang, I love you? My foot.'

source: 还曾怀疑过叶漓的哥哥们哪个不是人中龙凤，优秀十足。
en_us: He even suspected something. All of Ye Li's brothers were brilliant and outstanding individuals.

source: 还有叶眉在网上发生的那些，班上也是传的沸沸扬扬。
en_us: Everything that happened to Ye Mei on Twitter had also spread like wildfire.

source: 还有这一遭事儿发生？
en_us: 'Something like that happened?'

source: 还有，她这是对谁眨眼睛？
en_us: 'Also, who is she winking at?'

source: 还真敢说。
en_us: 'She's really bold enough to voice it out loud, huh?"

source: 还记得很小的时候，叶漓并不胖。
en_us: She remembered that Ye Li wasn't a chubby child.

source: 这一个两个的，真是一点也没将她放在眼里！
en_us: 'They really don't respect me at all!'

source: 这一举动顿时让于向阳难看的脸色缓和了不少，他也不是受不得委屈的人，向来能屈能伸，闻言点头：“行，这次是我不对，阿漓生气也是应当，麻烦学妹你帮忙了。”
en_us: That gesture made Yu Xiangyang's face seem less hostile. He was not a spoiled person who could not stand being aggrieved and he had always been able to give and take. He nodded and said, "Alright, it's my fault this time and it's only right that Li is upset at me. Thanks for your help, Junior."

source: 这一天，她连续被叶漓玩了好几次。
en_us: On this day, Ye Li played her out several times in a row.

source: 这一次上门道歉，也想过，若是妹妹愿意原谅他，那自己也不会再多说什么。
en_us: This time, he had thought about it and decided that he would not make any comments if his younger sister decided to forgive Yu Xiangyang after the latter made his apology in their home.

source: 这一波操作瞬间就被那些黑粉注意到了。
en_us: The haters immediately noticed what she had done.

source: 这一笑，又是一阵阵刺耳的尖叫声。
en_us: His smile resulted in another wave of ear-piercing shrieks.

source: 这一藏就是十几年，大家都以为早已送出国读书，谁料，这样一位大佬，竟然就在他们学校！
en_us: They kept her hidden for more than a decade and everyone thought that she had already been sent abroad to complete her education. However, no one expected this big shot to be in school!

source: 这三兄弟更是从未将她当妹妹来看。
en_us: The three brothers had never treated her as their younger sister.

source: 这下好了吧。
en_us: 'Great.'

source: 这下该怎么办。
en_us: 'What do we do now?'

source: 这不是对徐家的不尊重吗？
en_us: That's considered disrespect to the Xu Family, isn't it?

source: 这不是明晃晃的告诉大家说他们把人家已经要了的礼服卖给另一个人？
en_us: Ye Mei was clearly telling everyone that YS Fashion sold the dress that she had her eyes on, to someone else.

source: 这不是玩她吗！
en_us: Heaven is playing a joke on me!

source: 这两个邀请函竟然是同一个名字，怎么回事？
en_us: 'The names on these two invitation cards are the same. What's going on?'

source: 这两样叶眉都不差。
en_us: Ye Mei fulfilled that criteria rather well.

source: 这个位置，可是让她的身份地位在帝都大学十分崇高呢。
en_us: That status of hers allowed her to be put on a pedestal and admired by everyone in Beijing University.

source: 这个叫做温雅的女人她认识。
en_us: She knew that woman named Wen Ya too.

source: 这个女人上辈子害自己害的不必叶眉少，叶漓能表现出这幅漠然的表情已经是十分艰难。
en_us: In her previous life, this woman harmed her just as much as Ye Mei did. It was already difficult for Ye Mei to stay composed and indifferent towards her.

source: 这个女人报复心很强，什么都想跟她抢，特别是徐凤年，这样身材颜值家室都完美十足的男人，她不知道惦记了多久。
en_us: Ye Mei was extremely vengeful and she would vie with Ye Li for everything, especially Xu Fengnian. She had been harboring designs on this man who was perfect in every aspect, be it looks, figure, or family background.

source: 这个女孩子什么身份，竟然能让徐家夫人连续两次送请帖？
en_us: 'What's this girl's identity? She actually had the ability to make Mrs. Xu send her invitations twice in a row?'

source: 这个女孩子，肯定就是那位要嫁给徐家大少的叶家小姐！
en_us: They were certain that Ye Li was the daughter of the Ye Family who was going to marry Xu Fengnian!

source: 这个学校可不是校长最大，而是那些投资的大股东！
en_us: The principal did not have the final say in this school. The major shareholders who invested plenty of money were the ones who called the shots!

source: 这个年代的人都十分会打扮了，偏偏叶漓进入学校这么久，竟然也没丝毫改变。
en_us: In this day and age, most people were fashionable and dressed well. Yet, there was no change in Ye Li's appearance even though she had been admitted to the university for a long time.

source: 这个年纪就已经能装的这么深沉，不怪家里人的人都被她们两母女的表面所欺骗。
en_us: At such a tender age, she was actually already able to put on such a convincing pretense. It was no wonder that the people in her family were deceived by the facades of Ye Mei and her mother.

source: 这个房间她从小睡到大，记忆深刻，但是在自家被叶眉那个无耻女人剥夺之后，这个房间就已经从此消失，如今又怎么会出现。
en_us: The room, which she had slept in since she was a child, was deeply etched in her memory. However, it disappeared after the shameless woman Ye Mei appeared and snatched away her family. Since then, this room disappeared as well. Why did it appear again today?

source: 这个时候的叶漓，在她们看来，就好似一个魔鬼！
en_us: At this moment, Ye Li was just like a demon to her!

source: 这个时候的自己，还是一名大二的学生。
en_us: At this point in time, she was still a Year Two college student.

source: 这个时候，程艳走进来了。
en_us: At this moment, Cheng Yan entered.

source: 这个男人长得又帅，他们系的系草，若不是他太混又难接触，叶眉也想结交一番。
en_us: He was extremely handsome and was the beau of their faculty. If not for the fact that he was too roguish and difficult to get along with, Ye Mei would have tried to get associated with him.

source: 这个男人，说话可真是毒的，前一秒才让自己上了他的车，后一秒就拒绝了别人。
en_us: 'This man has got such a sharp tongue. A second after he told me to get inside his car, he turned her down.'

source: 这个男人，难道就是叶枫口中的那个徐家继承人，徐凤年？
en_us: 'Is that man the successor of the Xu Family that Ye Feng had mentioned, Xu Fengnian?'

source: 这个身份几乎已经成为了叶眉心中的一根刺。
en_us: Ye Mei's identity was almost a thorn in her flesh.

source: 这个车从里面可以看到外面，但是外面绝对是看不到里面的。
en_us: She could look outside the car window but the interior of the car was not visible to those outside.

source: 这丫头到底怎么回事，明明之前那么讨厌他，听说了要订婚的事时候还极度反对，可如今却又这样亲昵叫他。
en_us: 'What's wrong with this girl? She obviously hated me so much previously and after hearing about the engagement she even refuted vehemently. Yet, she's addressing me in such an affectionate manner now.'

source: 这丫头又要打什么主意。
en_us: 'What trick is this girl pulling again this time?'

source: 这丫头向来喜欢白白净净的男孩子，之前那个于向阳也是，如今表弟也是。
en_us: He knew that she had always liked neat-looking and fair boys. Yu Xiangyang and his cousing, Xu Han, both fit into that category.

source: 这丫头，做什么？
en_us: 'What is this girl doing?'

source: 这丫头，到底是受了什么刺激，那个于向阳对她造成的影响就那么大吗？
en_us: 'What huge blow did this girl exactly suffer? Did Yu Xiangyang cause such a great impact on her?'

source: 这丫头，还挺嘴利。
en_us: 'This girl has a sharp tongue.'

source: 这中心的位置，随便开一辆车，那都是价值百万千万。
en_us: In the central area, almost any random car on the streets would be worth millions to tens of millions of yuan.

source: 这么一个看起来圆圆润润的女孩子，他还真有些不忍心。
en_us: He really couldn't bear to be so harsh to a chubby girl like her.

source: 这么多人看着，她要是说不要，那不得被这些人看不起？
en_us: 'Everyone is watching. If I say no now, won't they all look down on me?'

source: 这么大的动静，势必也会给学校带来影响，可那个大神，也不是自己能说的起的人，本来还想找叶漓来谈谈，让她低调一点，不要闹出不好的绯闻影响学校的名声，结果自己还没找人呢，她就又犯事了，还不是小事，家长都找上门来了。
en_us: Since the matter escalated to such a height, it would definitely affect the school. However, the godlike figure, Ye Feng, was not someone he could afford to reprimand. He initially wanted to have a chat with Ye Li and tell her to keep a low profile so as to not get embroiled in any scandal that would affect the school's reputation. In the end, she had already gotten into trouble before he even asked to see her. To make matters worse, things escalated out of control and Meng Fei's parents got involved too.

source: 这么夸张的数据，直接给上了热搜第二！
en_us: The exaggerated data propelled her to the second place on the list of trending searches!

source: 这么好的条件，她竟然当做丑陋而遮挡。
en_us: She actually treated her beautiful feature as a hideous flaw that she wanted to hide.

source: 这也太过分了吧。
en_us: 'She has gone overboard.'

source: 这些事叶漓二十岁之前都是不知道的。
en_us: Ye Li did not know about those matters before she turned twenty.

source: 这些事情太过丢人，她不敢跟家里人说。
en_us: Those matters were too embarrassing and she dared not tell her family about it.

source: 这些人都是哪里来的，怎么一个长得比一个帅！
en_us: 'Where did all these people come from? They're all do dashing!'

source: 这些人都还不确定这到底是不是她的微博，就一阵乱喷，显然都已经失去理智。
en_us: They were unsure if it was her Twitter account but they were already sending her plenty of hateful messages. Clearly, they had already become irrational.

source: 这些伤害过她的人，这辈子，她叶漓一个也不会放过！
en_us: In this life, Ye Li would never let off anyone who had harmed her!

source: 这些千金小姐，别看在外面一副优雅高贵的模样。
en_us: The heiresses of wealthy families may look elegant and noble on the surface but deep down, they were extremely evil.

source: 这些年来，外面人的聚会都是她在应酬，所以下面的人收到邀请函，都会直接交给她。
en_us: Throughout the years, she would be the one showing up for social gatherings and the servants would hand her all the invitations that were sent to their home.

source: 这人的评论一下就被刷到了前面。
en_us: That person's reply made it to the top of the page.

source: 这什么情况？
en_us: What is going on?

source: 这仅仅是和叶枫吃了一顿饭，就在微博霸屏了一天的女孩，一夜之间火爆全网，粉丝超千万，热度堪比一线明星。
en_us: That was the attention that Ye Feng had drawn for having a meal with a girl who ended up going viral on Twitter and the Internet. Overnight, she gained more than 10 million followers and was even more popular than A-list celebrities.

source: 这件事不小，要是谈不好，可是要惊动警方的。
en_us: That matter was neither major nor trivial. If the discussion did not go well, the police would be involved.

source: 这件事叶漓记得很清楚。
en_us: Ye Li remembered that incident very clearly.

source: 这件事正跟程艳有关。
en_us: That matter had something to do with Cheng Yan.

source: 这件事虽然他们也听说过，但是谁也没提过。
en_us: Although they had heard about this matter, no one brought it up.

source: 这件事要真传出去，那不仅是徐家的名声，还有徐凤年也会跟着被人笑话。
en_us: If word about the matter were to get out, not only would the Xu Family's reputation be affected, Xu Fengnian would be seen as a laughing stock too.

source: 这件事闹的不小，全班人对她的态度都变了，老师也十分的厌恶她，叶漓被冤枉之后，都懵了，任由她如何解释也没人相信，还认为她知错不改，老师十分生气，罚了她打扫了一个月的卫生。
en_us: That matter blew up and all her classmates' attitude towards her changed. Even her teachers were disgusted and resentful towards her. After Ye Li was wrongly accused, she was dumbfounded. No matter how she tried to explain herself, no one believed her. They even felt that she wasn't repentant. The teacher was extremely infuriated and punished her by making her do cleaning chores for a month.

source: 这会儿也是一脸表情不屑的看向叶漓。
en_us: At this moment, she looked at Ye Li with a disdainful expression.

source: 这会儿他脸色变了，是不喜欢自己这样叫，还是觉得她太轻浮了。
en_us: 'His expression changed. Does he not like the way I called him or does he think I'm too frivolous?'

source: 这会儿别提多生气了。
en_us: They were extremely enraged.

source: 这会儿却故意说出来，不是天真，那就是如同阿漓所说，想要挑拨离间两家人的关系。
en_us: She had either deliberately said it out loud this time out of innocence, or she was trying to sow discord between the two families, just like what Ye Li said.

source: 这会儿却被人传播了出去，害的小妹受到这样的对待。
en_us: This time, it was leaked and caused their younger sister to be subjected to such terrible treatment.

source: 这会儿又有一穿着校服的少年走了进来。
en_us: At this moment, another young man who was wearing a school uniform entered.

source: 这会儿反应过来自己竟然被一个跟自己女儿一样大的小辈吓到，两人涨红了脸，怒火几乎要烧没了理智：“你这臭小子，竟然瞪我们，你知道我们是什么人吗？信不信我连你一起搞！”
en_us: At this moment, they realized that they had been frightened by someone who was of the same generation as their daughter. They turned red with embarrassment and their anger was almost getting the better of them. "You rascal, how dare you glower at us. Do you know who we are? Do you believe that I'll get you in trouble too!?!"

source: 这会儿叶眉也下课回来了，刚走进大门，就听到了门口传来车子发动机的声音。
en_us: At this moment, Ye Mei had also returned from school. As soon as she entered the door, she heard the sounds of the car engine getting revved up at the entrance.

source: 这会儿司机也跟上来了。
en_us: The chauffeur caught up.
